#1. 연습문제1
#  0, 120, 12, 7, 76, 24, 60, 121, 124, 103

# 편의상 10개씩 끊었지만 실제로는 7 Bytes의 데이터를 표현한 것
arr = [
    0,0,0,0,0,0,0,1,1,1, 1,0,0,0,0,0,0,1,1,0,  0,0,0,0,0,1,1,1,1,0,
       0,1,1,0,0,0,0,1,1,0, 0,0,0,1,1,1,1,0,0,1, 1,1,1,0,0,1,1,1,1,1, 1,0,0,1,1,0,0,1,1,1]

result = []

for i in range(10):
    n = 0
    # 7개씩 7개의 배열 set에 접근
    for j in range(i*7, i*7+7, 1):
        # arr[j] -> 0 or 1
        n = n * 2 + arr[j]
    result.append(n)
print(*result)

#  1,     1,     1,     1,     0,     0,    0
# 2^6    2^5    2^4    2^3    2^2    2^1   2&0